KANA_VOWEL_MAP = {
    'ｱ': 'a', 'ｲ': 'i', 'ｳ': 'u', 'ｴ': 'e', 'ｵ': 'o',"ｱｰ":'ɚ'
}
VOWELS = {
    'æ': 'ｱ', 'a': 'ｱ', 'ə': 'ｱ', 'ʌ': 'ｱ', 'e': 'ｴ', 'ɛ': 'ｴ',
    'i': 'ｲ', 'ɪ': 'ｲ', 'o': 'ｵ', 'ɔ': 'ｵ', 'u': 'ｳ', 'ʊ': 'ｳ',"ʌ":"ｱ",
    'ɚ': 'ｱー', 'ɝ': 'ｱー',"ɜː":"ｱｰ",'ɐ':'ｱ','ə':'ｩ',"uː":"ﾕ","ɑː":"ｱｯ","iː":"ｲｯ","ɯ":"ｳ","q":"ｸﾞｯ"
}
CONSONANTS = {
    'b': 'ﾌﾞ', 'd': 'ﾄﾞ', 'f': 'ﾌ', 'ɡ': 'ｸﾞ', 'h': 'ﾊ', 'k': 'ｸ',
    'l': 'ﾙ', 'm': 'ﾑ', 'n': 'ﾝ', 'p': 'ﾌﾟ', 's': 'ｽ', 't': 'ﾄ',
    'v': 'ｳﾞ', 'w': 'ｳ', 'j': 'ｲ', 'z': 'ｽﾞ', 'ʃ': 'ｼｭ', 'θ': 'ｽ',
    'ð': 'ｽﾞ', 'ŋ': 'ﾝ', 'ɹ': 'ﾙ', 'tʃ': 'ﾁ', 'dʒ': 'ｼﾞ', 'ʒ': 'ｼﾞｭ',"?":"?","ɫ":"ﾙ"
}
COMBINATIONS = {
    'b': {"ɯ":"ﾌﾞ",'æ':'ﾊﾞ', 'a':'ﾊﾞ', 'ə':'ﾊﾞ', 'ʌ':'ﾊﾞ', 'e':'ﾍﾞ', 'ɛ':'ﾍﾞ', 'i':'ﾋﾞ', 'ɪ':'ﾋﾞｰ', 'o':'ﾎﾞ', 'ɔ':'ﾎﾞ', 'u':'ﾌﾞ', 'ʊ':'ﾌﾞ', 'ɚ':'ﾊﾞｰ', 'ɝ':'ﾊﾞｰ', 'aɪ':'ﾊﾞｲ', 'aʊ':'ﾊﾞｳ', 'eɪ':'ﾍﾞｲ', 'oʊ':'ﾎﾞｳ', 'ɔɪ':'ﾎﾞｲ'},
    'd': {"ɯ":"ﾂﾞ",'æ':'ﾀﾞ', "ɑː":"ﾄﾞｯ",'a':'ﾀﾞ', 'ə':'ﾀﾞ', 'ʌ':'ﾀﾞ', 'e':'ﾃﾞ', 'ɛ':'ﾃﾞ', 'i':'ﾃﾞｨ', 'ɪ':'ﾃﾞｨ', 'o':'ﾄﾞ', 'ɔ':'ﾄﾞ', 'u':'ﾄﾞｩ', 'ʊ':'ﾄﾞｩ', 'ɚ':'ﾀﾞｰ', 'ɝ':'ﾀﾞｰ', 'aɪ':'ﾀﾞｲ', 'aʊ':'ﾀﾞｳ', 'eɪ':'ﾃﾞｲ', 'oʊ':'ﾄﾞｳ', 'ɔɪ':'ﾄﾞｲ'},
    'f': {"ɯ":"ﾌ",'æ':'ﾌｧ', 'a':'ﾌｧ', 'ə':'ﾌｧ', 'ʌ':'ﾌｧ', 'e':'ﾌｪ', 'ɛ':'ﾌｪ', 'i':'ﾌｨ', 'ɪ':'ﾌｨ', 'o':'ﾌｫ', 'ɔ':'ﾌｫ', 'u':'ﾌ', 'ʊ':'ﾌ', 'ɚ':'ﾌｧｰ', 'ɝ':'ﾌｧｰ', 'aɪ':'ﾌｧｲ', 'aʊ':'ﾌｧｳ', 'eɪ':'ﾌｪｲ', 'oʊ':'ﾌｫｳ', 'ɔɪ':'ﾌｫｲ'},
    'ɡ': {"ɯ":"ｸﾞ",'æ':'ｶﾞ', 'a':'ｶﾞ', 'ə':'ｶﾞ', 'ʌ':'ｶﾞ', 'e':'ｹﾞ', 'ɛ':'ｹﾞ', 'i':'ｷﾞ', 'ɪ':'ｷﾞ', 'o':'ｺﾞ', 'ɔ':'ｺﾞ', 'u':'ｸﾞ', 'ʊ':'ｸﾞ', 'ɚ':'ｶﾞｰ', 'ɝ':'ｶﾞｰ', 'aɪ':'ｶﾞｲ', 'aʊ':'ｶﾞｳ', 'eɪ':'ｹﾞｲ', 'oʊ':'ｺﾞｳ', 'ɔɪ':'ｺﾞｲ'},
    'h': {"ɯ":"ﾌ",'æ':'ﾊ', 'a':'ﾊ', 'ə':'ﾊ', 'ʌ':'ﾊ', 'e':'ﾍ', 'ɛ':'ﾍ', 'i':'ﾋ', 'ɪ':'ﾋ', 'o':'ﾎ', 'ɔ':'ﾎ', 'u':'ﾌ', 'ʊ':'ﾌ', 'ɚ':'ﾊｰ', 'ɝ':'ﾊｰ', 'aɪ':'ﾊｲ', 'aʊ':'ﾊｳ', 'eɪ':'ﾍｲ', 'oʊ':'ﾎｳ', 'ɔɪ':'ﾎｲ'},
    'k': {"ɯ":"ｸ",'æ':'ｶ', 'a':'ｶ', 'ə':'ｶ', 'ʌ':'ｶ', 'e':'ｹ', 'ɛ':'ｹ', 'i':'ｷ', 'ɪ':'ｷ', 'o':'ｺ', 'ɔ':'ｺ', 'u':'ｸ', 'ʊ':'ｸ', 'ɚ':'ｶｰ', 'ɝ':'ｶｰ', 'aɪ':'ｶｲ', 'aʊ':'ｶｳ', 'eɪ':'ｹｲ', 'oʊ':'ｺｳ', 'ɔɪ':'ｺｲ'},
    'l': {"ɯ":"ﾙ",'æ':'ﾗ', 'a':'ﾗ', 'ə':'ﾗ', 'ʌ':'ﾗ', 'e':'ﾚ', 'ɛ':'ﾚ', 'i':'ﾘ', 'ɪ':'ﾘ', 'o':'ﾛ', 'ɔ':'ﾛ', 'u':'ﾙ', 'ʊ':'ﾙ', 'ɚ':'ﾗｰ', 'ɝ':'ﾗｰ', 'aɪ':'ﾗｲ', 'aʊ':'ﾗｳ', 'eɪ':'ﾚｲ', 'oʊ':'ﾛｳ', 'ɔɪ':'ﾛｲ'},
    'm': {"ɯ":"ﾑ",'æ':'ﾏ', 'a':'ﾏ', 'ə':'ﾏ', 'ʌ':'ﾏ', 'e':'ﾒ', 'ɛ':'ﾒ', 'i':'ﾐ', 'ɪ':'ﾐ', 'o':'ﾓ', 'ɔ':'ﾓ', 'u':'ﾑ', 'ʊ':'ﾑ', 'ɚ':'ﾏｰ', 'ɝ':'ﾏｰ', 'aɪ':'ﾏｲ', 'aʊ':'ﾏｳ', 'eɪ':'ﾒｲ', 'oʊ':'ﾓｳ', 'ɔɪ':'ﾓｲ'},
    'n': {"ɯ":"ﾇ",'æ':'ﾅ', 'a':'ﾅ', 'ə':'ﾅ', 'ʌ':'ﾅ', 'e':'ﾈ', 'ɛ':'ﾈ', 'i':'ﾆ', 'ɪ':'ﾆ', 'o':'ﾉ', 'ɔ':'ﾉ', 'u':'ﾇ', 'ʊ':'ﾇ', 'ɚ':'ﾅｰ', 'ɝ':'ﾅｰ', 'aɪ':'ﾅｲ', 'aʊ':'ﾅｳ', 'eɪ':'ﾈｲ', 'oʊ':'ﾉｳ', 'ɔɪ':'ﾉｲ',"ɯ":"ﾇ"},
    'p': {"ɯ":"ﾌﾟ",'æ':'ﾊﾟ', 'a':'ﾊﾟ', 'ə':'ﾊﾟ', 'ʌ':'ﾊﾟ', 'e':'ﾍﾟ', 'ɛ':'ﾍﾟ', 'i':'ﾋﾟ', 'ɪ':'ﾋﾟ', 'o':'ﾎﾟ', 'ɔ':'ﾎﾟ', 'u':'ﾌﾟ', 'ʊ':'ﾌﾟ', 'ɚ':'ﾊﾟｰ', 'ɝ':'ﾊﾟｰ', 'aɪ':'ﾊﾟｲ', 'aʊ':'ﾊﾟｳ', 'eɪ':'ﾍﾟｲ', 'oʊ':'ﾎﾟｳ', 'ɔɪ':'ﾎﾟｲ'},
    's': {"ɯ":"ｽ",'æ':'ｻ', 'a':'ｻ', 'ə':'ｻ', 'ʌ':'ｻ', 'e':'ｾ', 'ɛ':'ｾ', 'i':'ｽｨ', 'ɪ':'ｽｨ', 'o':'ｿ', 'ɔ':'ｿ', 'u':'ｽ', 'ʊ':'ｽ', 'ɚ':'ｻｰ', 'ɝ':'ｻｰ', 'aɪ':'ｻｲ', 'aʊ':'ｻｳ', 'eɪ':'ｾｲ', 'oʊ':'ｿｳ', 'ɔɪ':'ｿｲ'},
    't': {"ɯ":"ﾂ",'æ':'ﾀ', 'a':'ﾀ', 'ə':'ﾄｩ', 'ʌ':'ﾀ', 'e':'ﾃ', 'ɛ':'ﾃ', 'i':'ﾃｨ', 'ɪ':'ﾃｨ', 'o':'ﾄ', 'ɔ':'ﾄ', 'u':'ﾄｩ', 'ʊ':'ﾄｩ', 'ɚ':'ﾀｰ', 'ɝ':'ﾀｰ', 'aɪ':'ﾀｲ', 'aʊ':'ﾀｳ', 'eɪ':'ﾃｲ', 'oʊ':'ﾄｳ', 'ɔɪ':'ﾄｲ'},
    'v': {"ɯ":"ｳﾞ",'æ':'ｳﾞｧ', 'a':'ｳﾞｧ', 'ə':'ｳﾞｧ', 'ʌ':'ｳﾞｧ', 'e':'ｳﾞｪ', 'ɛ':'ｳﾞｪ', 'i':'ｳﾞｨ', 'ɪ':'ｳﾞｨ', 'o':'ｳﾞｫ', 'ɔ':'ｳﾞｫ', 'u':'ｳﾞ', 'ʊ':'ｳﾞ', 'ɚ':'ｳﾞｧｰ', 'ɝ':'ｳﾞｧｰ', 'aɪ':'ｳﾞｧｲ', 'aʊ':'ｳﾞｧｳ', 'eɪ':'ｳﾞｪｲ', 'oʊ':'ｳﾞｫｳ', 'ɔɪ':'ｳﾞｫｲ'},
    'w': {"ɯ":"ｳ",'æ':'ﾜ', "ɜː":"ﾜ-",'a':'ﾜ', 'ə':'ﾜ', 'ʌ':'ﾜ', 'e':'ｳｪ', 'ɛ':'ｳｪ', 'i':'ｳｨ', 'ɪ':'ｳｨ', 'o':'ｳｫ', 'ɔ':'ｳｫ', 'u':'ｳ', 'ʊ':'ｳ', 'ɚ':'ﾜｰ', 'ɝ':'ﾜｰ', 'aɪ':'ﾜｲ', 'aʊ':'ﾜｳ', 'eɪ':'ｳｪｲ', 'oʊ':'ｳｫｳ', 'ɔɪ':'ｳｫｲ'},
    'j': {"ɯ":"ｭ",'æ':'ﾔ', "uː":"ﾕｰ",'a':'ﾔ', 'ə':'ﾔ', 'ʌ':'ﾔ', 'e':'ｲｪ', 'ɛ':'ｲｪ', 'i':'ｲ', 'ɪ':'ｲ', 'o':'ﾖ', 'ɔ':'ﾖ', 'u':'ﾕ', 'ʊ':'ﾕ', 'ɚ':'ﾔｰ', 'ɝ':'ﾔｰ', 'aɪ':'ﾔｲ', 'aʊ':'ﾔｳ', 'eɪ':'ｲｪｲ', 'oʊ':'ﾖｳ', 'ɔɪ':'ﾖｲ'},
    'z': {"ɯ":"ｽﾞ",'æ':'ｻﾞ', 'a':'ｻﾞ', 'ə':'ｻﾞ', 'ʌ':'ｻﾞ', 'e':'ｾﾞ', 'ɛ':'ｾﾞ', 'i':'ｽﾞｨ', 'ɪ':'ｽﾞｨ', 'o':'ｿﾞ', 'ɔ':'ｿﾞ', 'u':'ｽﾞ', 'ʊ':'ｽﾞ', 'ɚ':'ｻﾞｰ', 'ɝ':'ｻﾞｰ', 'aɪ':'ｻﾞｲ', 'aʊ':'ｻﾞｳ', 'eɪ':'ｾﾞｲ', 'oʊ':'ｿﾞｳ', 'ɔɪ':'ｿﾞｲ'},
    'ʃ': {"ɯ":"ｼｭ",'æ':'ｼｬ', 'a':'ｼｬ', 'ə':'ｼｬ', 'ʌ':'ｼｬ', 'e':'ｼｪ', 'ɛ':'ｼｪ', 'i':'ｼ', 'ɪ':'ｼ', 'o':'ｼｮ', 'ɔ':'ｼｮ', 'u':'ｼｭ', 'ʊ':'ｼｭ', 'ɚ':'ｼｬｰ', 'ɝ':'ｼｬｰ', 'aɪ':'ｼｬｲ', 'aʊ':'ｼｬｳ', 'eɪ':'ｼｪｲ', 'oʊ':'ｼｮｳ', 'ɔɪ':'ｼｮｲ'},
    'tʃ': {"ɯ":"ﾁｭ",'æ':'ﾁｬ', 'a':'ﾁｬ', 'ə':'ﾁｬ', 'ʌ':'ﾁｬ', 'e':'ﾁｪ', 'ɛ':'ﾁｪ', 'i':'ﾁ', 'ɪ':'ﾁ', 'o':'ﾁｮ', 'ɔ':'ﾁｮ', 'u':'ﾁｭ', 'ʊ':'ﾁｭ', 'ɚ':'ﾁｬｰ', 'ɝ':'ﾁｬｰ', 'aɪ':'ﾁｬｲ', 'aʊ':'ﾁｬｳ', 'eɪ':'ﾁｪｲ', 'oʊ':'ﾁｮｳ', 'ɔɪ':'ﾁｮｲ'},
    'dʒ': {"ɯ":"ｼﾞｭ",'æ':'ｼﾞｬ', "uː":"ｼﾞｭ",'a':'ｼﾞｬ', 'ə':'ｼﾞｬ', 'ʌ':'ｼﾞｬ', 'e':'ｼﾞｪ', 'ɛ':'ｼﾞｪ', 'i':'ｼﾞ', 'ɪ':'ｼﾞ', 'o':'ｼﾞｮ', 'ɔ':'ｼﾞｮ', 'u':'ｼﾞｭ', 'ʊ':'ｼﾞｭ', 'ɚ':'ｼﾞｬｰ', 'ɝ':'ｼﾞｬｰ', 'aɪ':'ｼﾞｬｲ', 'aʊ':'ｼﾞｬｳ', 'eɪ':'ｼﾞｪｲ', 'oʊ':'ｼﾞｮｳ', 'ɔɪ':'ｼﾞｮｲ'},
    'ʒ': {"ɯ":"ｼﾞｭ",'æ':'ｼﾞｬ', 'a':'ｼﾞｬ', 'ə':'ｼﾞｬ', 'ʌ':'ｼﾞｬ', 'e':'ｼﾞｪ', 'ɛ':'ｼﾞｪ', 'i':'ｼﾞ', 'ɪ':'ｼﾞ', 'o':'ｼﾞｮ', 'ɔ':'ｼﾞｮ', 'u':'ｼﾞｭ', 'ʊ':'ｼﾞｭ', 'ɚ':'ｼﾞｬｰ', 'ɝ':'ｼﾞｬｰ', 'aɪ':'ｼﾞｬｲ', 'aʊ':'ｼﾞｬｳ', 'eɪ':'ｼﾞｪｲ', 'oʊ':'ｼﾞｮｳ', 'ɔɪ':'ｼﾞｮｲ'},
    'ɹ': {"ɯ":"ﾙ",'æ':'ﾗ', 'a':'ﾗ', 'ə':'ﾗ', 'ʌ':'ﾗ', 'e':'ﾚ', 'ɛ':'ﾚ', 'i':'ﾘ', 'ɪ':'ﾘ', 'o':'ﾛ', 'ɔ':'ﾛ', 'u':'ﾙ', 'ʊ':'ﾙ', 'ɚ':'ﾗｰ', 'ɝ':'ﾗｰ', 'aɪ':'ﾗｲ', 'aʊ':'ﾗｳ', 'eɪ':'ﾚｲ', 'oʊ':'ﾛｳ', 'ɔɪ':'ﾛｲ'},
    'θ': {"ɯ":"ｽ",'æ':'ｾ', 'a':'ｻ', 'ə':'ｻ', 'ʌ':'ｻ', 'e':'ｾ', 'ɛ':'ｾ', 'i':'ｽｨ', 'ɪ':'ｽｨ', 'o':'ｿ', 'ɔ':'ｿ', 'u':'ｽ', 'ʊ':'ｽ', 'ɚ':'ｻｰ', 'ɝ':'ｻｰ', 'aɪ':'ｻｲ', 'aʊ':'ｻｳ', 'eɪ':'ｾｲ', 'oʊ':'ｿｳ', 'ɔɪ':'ｿｲ'},
    'ð': {"ɯ":"ｽﾞ",'æ':'ｻﾞ', 'a':'ｻﾞ', 'ə':'ｻﾞ', 'ʌ':'ｻﾞ', 'e':'ｾﾞ', 'ɛ':'ｾﾞ', 'i':'ｽﾞｨ', 'ɪ':'ｽﾞｨ', 'o':'ｿﾞ', 'ɔ':'ｿﾞ', 'u':'ｽﾞ', 'ʊ':'ｽﾞ', 'ɚ':'ｻﾞｰ', 'ɝ':'ｻﾞｰ', 'aɪ':'ｻﾞｲ', 'aʊ':'ｻﾞｳ', 'eɪ':'ｾﾞｲ', 'oʊ':'ｿﾞｳ', 'ɔɪ':'ｿﾞｲ'},
    'kʲ':{"ɯ":"ｷｭ",'uː':'ｷｭｰ', 'a':'ｷｬ', 'ə':'ｷｮ', 'o':'ｷｮ', 'u':'ｷｭ'},
    "q":{"ɯ":"ｸﾞ",'æ':'ｶﾞ', 'a':'ｶﾞ', 'ə':'ｶﾞ', 'ʌ':'ｶﾞ', 'e':'ｹﾞ', 'ɛ':'ｹﾞ', 'i':'ｷﾞ', 'ɪ':'ｷﾞ', 'o':'ｺﾞ', 'ɔ':'ｺﾞ', 'u':'ｸﾞ', 'ʊ':'ｸﾞ', 'ɚ':'ｶﾞｰ', 'ɝ':'ｶﾞｰ', 'aɪ':'ｶﾞｲ', 'aʊ':'ｶﾞｳ', 'eɪ':'ｹﾞｲ', 'oʊ':'ｺﾞｳ', 'ɔɪ':'ｺﾞｲ'}
}
COMBINATIONS = {
    'b': {'æ':'ﾊﾞ', 'a':'ﾊﾞ', 'ɐ':'ﾊﾞ', 'ə':'ﾊﾞ', 'ʌ':'ﾊﾞ', 'e':'ﾍﾞ', 'ɛ':'ﾍﾞ', 'i':'ﾋﾞ', 'ɪ':'ﾋﾞ', 'iː':'ﾋﾞｰ', 'o':'ﾎﾞ', 'ɔ':'ﾎﾞ', 'u':'ﾌﾞ', 'ʊ':'ﾌﾞ', 'uː':'ﾌﾞｰ', 'ɚ':'ﾊﾞｰ', 'ɝ':'ﾊﾞｰ', 'ɜː':'ﾊﾞｰ', 'ɑː':'ﾊﾞｰ', 'aɪ':'ﾊﾞｲ', 'aʊ':'ﾊﾞｳ', 'eɪ':'ﾍﾞｲ', 'oʊ':'ﾎﾞｳ', 'ɔɪ':'ﾎﾞｲ'},
    'd': {'æ':'ﾀﾞ', 'a':'ﾀﾞ', 'ɐ':'ﾀﾞ', 'ə':'ﾀﾞ', 'ʌ':'ﾀﾞ', 'e':'ﾃﾞ', 'ɛ':'ﾃﾞ', 'i':'ﾃﾞｨ', 'ɪ':'ﾃﾞｨ', 'iː':'ﾃﾞｨｰ', 'o':'ﾄﾞ', 'ɔ':'ﾄﾞ', 'u':'ﾄﾞｩ', 'ʊ':'ﾄﾞｩ', 'uː':'ﾄﾞｩｰ', 'ɚ':'ﾀﾞｰ', 'ɝ':'ﾀﾞｰ', 'ɜː':'ﾀﾞｰ', 'ɑː':'ﾄﾞｯ', 'aɪ':'ﾀﾞｲ', 'aʊ':'ﾀﾞｳ', 'eɪ':'ﾃﾞｲ', 'oʊ':'ﾄﾞｳ', 'ɔɪ':'ﾄﾞｲ'},
    'f': {'æ':'ﾌｧ', 'a':'ﾌｧ', 'ɐ':'ﾌｧ', 'ə':'ﾌｧ', 'ʌ':'ﾌｧ', 'e':'ﾌｪ', 'ɛ':'ﾌｪ', 'i':'ﾌｨ', 'ɪ':'ﾌｨ', 'iː':'ﾌｨｰ', 'o':'ﾌｫ', 'ɔ':'ﾌｫ', 'u':'ﾌ', 'ʊ':'ﾌ', 'uː':'ﾌｰ', 'ɚ':'ﾌｧｰ', 'ɝ':'ﾌｧｰ', 'ɜː':'ﾌｧｰ', 'ɑː':'ﾌｧｰ', 'aɪ':'ﾌｧｲ', 'aʊ':'ﾌｧｳ', 'eɪ':'ﾌｪｲ', 'oʊ':'ﾌｫｳ', 'ɔɪ':'ﾌｫｲ'},
    'ɡ': {'æ':'ｶﾞ', 'a':'ｶﾞ', 'ɐ':'ｶﾞ', 'ə':'ｶﾞ', 'ʌ':'ｶﾞ', 'e':'ｹﾞ', 'ɛ':'ｹﾞ', 'i':'ｷﾞ', 'ɪ':'ｷﾞ', 'iː':'ｷﾞｰ', 'o':'ｺﾞ', 'ɔ':'ｺﾞ', 'u':'ｸﾞ', 'ʊ':'ｸﾞ', 'uː':'ｸﾞｰ', 'ɚ':'ｶﾞｰ', 'ɝ':'ｶﾞｰ', 'ɜː':'ｶﾞｰ', 'ɑː':'ｶﾞｰ', 'aɪ':'ｶﾞｲ', 'aʊ':'ｶﾞｳ', 'eɪ':'ｹﾞｲ', 'oʊ':'ｺﾞｳ', 'ɔɪ':'ｺﾞｲ'},
    'h': {'æ':'ﾊ', 'a':'ﾊ', 'ɐ':'ﾊ', 'ə':'ﾊ', 'ʌ':'ﾊ', 'e':'ﾍ', 'ɛ':'ﾍ', 'i':'ﾋ', 'ɪ':'ﾋ', 'iː':'ﾋィ', 'o':'ﾎ', 'ɔ':'ﾎ', 'u':'ﾌ', 'ʊ':'ﾌ', 'uː':'ﾌｰ', 'ɚ':'ﾊｰ', 'ɝ':'ﾊｰ', 'ɜː':'ﾊｰ', 'ɑː':'ﾊｰ', 'aɪ':'ﾊｲ', 'aʊ':'ﾊｳ', 'eɪ':'ﾍｲ', 'oʊ':'ﾎｳ', 'ɔɪ':'ﾎｲ'},
    'k': {'æ':'ｷｬ', 'a':'ｶ', 'ɐ':'ｶ', 'ə':'ｶ', 'ʌ':'ｶ', 'e':'ｹ', 'ɛ':'ｹ', 'i':'ｷ', 'ɪ':'ｷ', 'iː':'ｷｰ', 'o':'ｺ', 'ɔ':'ｺ', 'u':'ｸ', 'ʊ':'ｸ', 'uː':'ｸｰ', 'ɚ':'ｶｰ', 'ɝ':'ｶｰ', 'ɜː':'ｶｰ', 'ɑː':'ｶｰ', 'aɪ':'ｶｲ', 'aʊ':'ｶｳ', 'eɪ':'ｹｲ', 'oʊ':'ｺｳ', 'ɔɪ':'ｺｲ'},
    'l': {'æ':'ﾗ', 'a':'ﾗ', 'ɐ':'ﾗ', 'ə':'ﾗ', 'ʌ':'ﾗ', 'e':'ﾚ', 'ɛ':'ﾚ', 'i':'ﾘ', 'ɪ':'ﾘ', 'iː':'ﾘｰ', 'o':'ﾛ', 'ɔ':'ﾛ', 'u':'ﾙ', 'ʊ':'ﾙ', 'uː':'ﾙｰ', 'ɚ':'ﾗｰ', 'ɝ':'ﾗｰ', 'ɜː':'ﾗｰ', 'ɑː':'ﾗｰ', 'aɪ':'ﾗｲ', 'aʊ':'ﾗｳ', 'eɪ':'ﾚｲ', 'oʊ':'ﾛｳ', 'ɔɪ':'ﾛｲ'},
    'm': {'æ':'ﾏ', 'a':'ﾏ', 'ɐ':'ﾏ', 'ə':'ﾏ', 'ʌ':'ﾏ', 'e':'ﾒ', 'ɛ':'ﾒ', 'i':'ﾐ', 'ɪ':'ﾐ', 'iː':'ﾐｰ', 'o':'ﾓ', 'ɔ':'ﾓ', 'u':'ﾑ', 'ʊ':'ﾑ', 'uː':'ﾑｰ', 'ɚ':'ﾏｰ', 'ɝ':'ﾏｰ', 'ɜː':'ﾏｰ', 'ɑː':'ﾏｰ', 'aɪ':'ﾏｲ', 'aʊ':'ﾏｳ', 'eɪ':'ﾒｲ', 'oʊ':'ﾓｳ', 'ɔɪ':'ﾓｲ'},
    'n': {'æ':'ﾅ', 'a':'ﾅ', 'ɐ':'ﾅ', 'ə':'ﾅ', 'ʌ':'ﾅ', 'e':'ﾈ', 'ɛ':'ﾈ', 'i':'ﾆ', 'ɪ':'ﾆ', 'iː':'ﾆｰ', 'o':'ﾉ', 'ɔ':'ﾉ', 'u':'ﾇ', 'ʊ':'ﾇ', 'uː':'ﾇｰ', 'ɚ':'ﾅｰ', 'ɝ':'ﾅｰ', 'ɜː':'ﾅｰ', 'ɑː':'ﾅｰ', 'aɪ':'ﾅｲ', 'aʊ':'ﾅｳ', 'eɪ':'ﾈｲ', 'oʊ':'ﾉｳ', 'ɔɪ':'ﾉｲ'},
    'p': {'æ':'ﾊﾟ', 'a':'ﾊﾟ', 'ɐ':'ﾊﾟ', 'ə':'ﾊﾟ', 'ʌ':'ﾊﾟ', 'e':'ﾍﾟ', 'ɛ':'ﾍﾟ', 'i':'ﾋﾟ', 'ɪ':'ﾋﾟ', 'iː':'ﾋﾟｰ', 'o':'ﾎﾟ', 'ɔ':'ﾎﾟ', 'u':'ﾌﾟ', 'ʊ':'ﾌﾟ', 'uː':'ﾌﾟｰ', 'ɚ':'ﾊﾟｰ', 'ɝ':'ﾊﾟｰ', 'ɜː':'ﾊﾟｰ', 'ɑː':'ﾊﾟｰ', 'aɪ':'ﾊﾟｲ', 'aʊ':'ﾊﾟｳ', 'eɪ':'ﾍﾟｲ', 'oʊ':'ﾎﾟｳ', 'ɔɪ':'ﾎﾟｲ'},
    's': {'æ':'ｻ', 'a':'ｻ', 'ɐ':'ｻ', 'ə':'ｻ', 'ʌ':'ｻ', 'e':'ｾ', 'ɛ':'ｾ', 'i':'ｼ', 'ɪ':'ｼ', 'iː':'ｼｰ', 'o':'ｿ', 'ɔ':'ｿ', 'u':'ｽ', 'ʊ':'ｽ', 'uː':'ｽｰ', 'ɚ':'ｻｰ', 'ɝ':'ｻｰ', 'ɜː':'ｻｰ', 'ɑː':'ｻｰ', 'aɪ':'ｻｲ', 'aʊ':'ｻｳ', 'eɪ':'ｾｲ', 'oʊ':'ｿｳ', 'ɔɪ':'ｿｲ'}, # s+i/ɪ は「シ」に
    't': {'æ':'ﾀ', 'a':'ﾀ', 'ɐ':'ﾀ', 'ə':'ﾄｩ', 'ʌ':'ﾀ', 'e':'ﾃ', 'ɛ':'ﾃ', 'i':'ﾃｨ', 'ɪ':'ﾃｨ', 'iː':'ﾃｨｰ', 'o':'ﾄ', 'ɔ':'ﾄ', 'u':'ﾄｩ', 'ʊ':'ﾄｩ', 'uː':'ﾄｩｰ', 'ɚ':'ﾀｰ', 'ɝ':'ﾀｰ', 'ɜː':'ﾀｰ', 'ɑː':'ﾀｰ', 'aɪ':'ﾀｲ', 'aʊ':'ﾀｳ', 'eɪ':'ﾃｲ', 'oʊ':'ﾄｳ', 'ɔɪ':'ﾄｲ'},
    'v': {'æ':'ｳﾞｧ', 'a':'ｳﾞｧ', 'ɐ':'ｳﾞｧ', 'ə':'ｳﾞｧ', 'ʌ':'ｳﾞｧ', 'e':'ｳﾞｪ', 'ɛ':'ｳﾞｪ', 'i':'ｳﾞｨ', 'ɪ':'ｳﾞｨ', 'iː':'ｳﾞｨｰ', 'o':'ｳﾞｫ', 'ɔ':'ｳﾞｫ', 'u':'ｳﾞ', 'ʊ':'ｳﾞ', 'uː':'ｳﾞｰ', 'ɚ':'ｳﾞｧｰ', 'ɝ':'ｳﾞｧｰ', 'ɜː':'ｳﾞｧｰ', 'ɑː':'ｳﾞｧｰ', 'aɪ':'ｳﾞｧｲ', 'aʊ':'ｳﾞｧｳ', 'eɪ':'ｳﾞｪｲ', 'oʊ':'ｳﾞｫｳ', 'ɔɪ':'ｳﾞｫｲ'},
    'w': {'æ':'ﾜ', 'a':'ﾜ', 'ɐ':'ﾜ', 'ə':'ﾜ', 'ʌ':'ﾜ', 'e':'ｳｪ', 'ɛ':'ｳｪ', 'i':'ｳｨ', 'ɪ':'ｳｨ', 'iː':'ｳｨｰ', 'o':'ｳｫ', 'ɔ':'ｳｫ', 'u':'ｳ', 'ʊ':'ｳ', 'uː':'ｳｰ', 'ɚ':'ﾜｰ', 'ɝ':'ﾜｰ', 'ɜː':'ﾜｰ', 'ɑː':'ﾜｰ', 'aɪ':'ﾜｲ', 'aʊ':'ﾜｳ', 'eɪ':'ｳｪｲ', 'oʊ':'ｳｫｳ', 'ɔɪ':'ｳｫｲ'},
    'j': {'æ':'ﾔ', 'a':'ﾔ', 'ɐ':'ﾔ', 'ə':'ﾔ', 'ʌ':'ﾔ', 'e':'ｲｪ', 'ɛ':'ｲｪ', 'i':'ｲ', 'ɪ':'ｲ', 'iː':'ｲｰ', 'o':'ﾖ', 'ɔ':'ﾖ', 'u':'ﾕ', 'ʊ':'ﾕ', 'uː':'ﾕｰ', 'ɚ':'ﾔｰ', 'ɝ':'ﾔｰ', 'ɜː':'ﾔｰ', 'ɑː':'ﾔｰ', 'aɪ':'ﾔｲ', 'aʊ':'ﾔｳ', 'eɪ':'ｲｪｲ', 'oʊ':'ﾖｳ', 'ɔɪ':'ﾖｲ'},
    'z': {'æ':'ｻﾞ', 'a':'ｻﾞ', 'ɐ':'ｻﾞ', 'ə':'ｻﾞ', 'ʌ':'ｻﾞ', 'e':'ｾﾞ', 'ɛ':'ｾﾞ', 'i':'ｼﾞ', 'ɪ':'ｼﾞ', 'iː':'ｼﾞｰ', 'o':'ｿﾞ', 'ɔ':'ｿﾞ', 'u':'ｽﾞ', 'ʊ':'ｽﾞ', 'uː':'ｽﾞｰ', 'ɚ':'ｻﾞｰ', 'ɝ':'ｻﾞｰ', 'ɜː':'ｻﾞｰ', 'ɑː':'ｻﾞｰ', 'aɪ':'ｻﾞｲ', 'aʊ':'ｻﾞｳ', 'eɪ':'ｾﾞｲ', 'oʊ':'ｿﾞｳ', 'ɔɪ':'ｿﾞｲ'}, # z+i/ɪ は「ジ」に
    'ʃ': {'æ':'ｼｬ', 'a':'ｼｬ', 'ɐ':'ｼｬ', 'ə':'ｼｬ', 'ʌ':'ｼｬ', 'e':'ｼｪ', 'ɛ':'ｼｪ', 'i':'ｼ', 'ɪ':'ｼ', 'iː':'ｼｰ', 'o':'ｼｮ', 'ɔ':'ｼｮ', 'u':'ｼｭ', 'ʊ':'ｼｭ', 'uː':'ｼｭｰ', 'ɚ':'ｼｬｰ', 'ɝ':'ｼｬｰ', 'ɜː':'ｼｬｰ', 'ɑː':'ｼｬｰ', 'aɪ':'ｼｬｲ', 'aʊ':'ｼｬｳ', 'eɪ':'ｼｪｲ', 'oʊ':'ｼｮｳ', 'ɔɪ':'ｼｮｲ'},
    'tʃ': {'æ':'ﾁｬ', 'a':'ﾁｬ', 'ɐ':'ﾁｬ', 'ə':'ﾁｬ', 'ʌ':'ﾁｬ', 'e':'ﾁｪ', 'ɛ':'ﾁｪ', 'i':'ﾁ', 'ɪ':'ﾁ', 'iː':'ﾁｰ', 'o':'ﾁｮ', 'ɔ':'ﾁｮ', 'u':'ﾁｭ', 'ʊ':'ﾁｭ', 'uː':'ﾁｭｰ', 'ɚ':'ﾁｬｰ', 'ɝ':'ﾁｬｰ', 'ɜː':'ﾁｬｰ', 'ɑː':'ﾁｬｰ', 'aɪ':'ﾁｬｲ', 'aʊ':'ﾁｬｳ', 'eɪ':'ﾁｪｲ', 'oʊ':'ﾁｮｳ', 'ɔɪ':'ﾁｮｲ'},
    'dʒ': {'æ':'ｼﾞｬ', 'a':'ｼﾞｬ', 'ɐ':'ｼﾞｬ', 'ə':'ｼﾞｬ', 'ʌ':'ｼﾞｬ', 'e':'ｼﾞｪ', 'ɛ':'ｼﾞｪ', 'i':'ｼﾞ', 'ɪ':'ｼﾞ', 'iː':'ｼﾞｰ', 'o':'ｼﾞｮ', 'ɔ':'ｼﾞｮ', 'u':'ｼﾞｭ', 'ʊ':'ｼﾞｭ', 'uː':'ｼﾞｭｰ', 'ɚ':'ｼﾞｬｰ', 'ɝ':'ｼﾞｬｰ', 'ɜː':'ｼﾞｬｰ', 'ɑː':'ｼﾞｬｰ', 'aɪ':'ｼﾞｬｲ', 'aʊ':'ｼﾞｬｳ', 'eɪ':'ｼﾞｪｲ', 'oʊ':'ｼﾞｮｳ', 'ɔɪ':'ｼﾞｮｲ'},
    'ʒ': {'æ':'ｼﾞｬ', 'a':'ｼﾞｬ', 'ɐ':'ｼﾞｬ', 'ə':'ｼﾞｬ', 'ʌ':'ｼﾞｬ', 'e':'ｼﾞｪ', 'ɛ':'ｼﾞｪ', 'i':'ｼﾞ', 'ɪ':'ｼﾞ', 'iː':'ｼﾞｰ', 'o':'ｼﾞｮ', 'ɔ':'ｼﾞｮ', 'u':'ｼﾞｭ', 'ʊ':'ｼﾞｭ', 'uː':'ｼﾞｭｰ', 'ɚ':'ｼﾞｬｰ', 'ɝ':'ｼﾞｬｰ', 'ɜː':'ｼﾞｬｰ', 'ɑː':'ｼﾞｬｰ', 'aɪ':'ｼﾞｬｲ', 'aʊ':'ｼﾞｬｳ', 'eɪ':'ｼﾞｪｲ', 'oʊ':'ｼﾞｮｳ', 'ɔɪ':'ｼﾞｮｲ'},
    'ɹ': {'æ':'ﾗ', 'a':'ﾗ', 'ɐ':'ﾗ', 'ə':'ﾗ', 'ʌ':'ﾗ', 'e':'ﾚ', 'ɛ':'ﾚ', 'i':'ﾘ', 'ɪ':'ﾘ', 'iː':'ﾘｰ', 'o':'ﾛ', 'ɔ':'ﾛ', 'u':'ﾙ', 'ʊ':'ﾙ', 'uː':'ﾙｰ', 'ɚ':'ﾗｰ', 'ɝ':'ﾗｰ', 'ɜː':'ﾗｰ', 'ɑː':'ﾗｰ', 'aɪ':'ﾗｲ', 'aʊ':'ﾗｳ', 'eɪ':'ﾚｲ', 'oʊ':'ﾛｳ', 'ɔɪ':'ﾛｲ'},
    'θ': {'æ':'ｻ', 'a':'ｻ', 'ɐ':'ｻ', 'ə':'ｻ', 'ʌ':'ｻ', 'e':'ｾ', 'ɛ':'ｾ', 'i':'ｽｨ', 'ɪ':'ｽｨ', 'iː':'ｽｨｰ', 'o':'ｿ', 'ɔ':'ｿ', 'u':'ｽ', 'ʊ':'ｽ', 'uː':'ｽｰ', 'ɚ':'ｻｰ', 'ɝ':'ｻｰ', 'ɜː':'ｻｰ', 'ɑː':'ｻｰ', 'aɪ':'ｻｲ', 'aʊ':'ｻｳ', 'eɪ':'ｾｲ', 'oʊ':'ｿｳ', 'ɔɪ':'ｿｲ'},
    'ð': {'æ':'ｻﾞ', 'a':'ｻﾞ', 'ɐ':'ｻﾞ', 'ə':'ｻﾞ', 'ʌ':'ｻﾞ', 'e':'ｾﾞ', 'ɛ':'ｾﾞ', 'i':'ｽﾞｨ', 'ɪ':'ｽﾞｨ', 'iː':'ｽﾞｨｰ', 'o':'ｿﾞ', 'ɔ':'ｿﾞ', 'u':'ｽﾞ', 'ʊ':'ｽﾞ', 'uː':'ｽﾞｰ', 'ɚ':'ｻﾞｰ', 'ɝ':'ｻﾞｰ', 'ɜː':'ｻﾞｰ', 'ɑː':'ｻﾞｰ', 'aɪ':'ｻﾞｲ', 'aʊ':'ｻﾞｳ', 'eɪ':'ｾﾞｲ', 'oʊ':'ｿﾞｳ', 'ɔɪ':'ｿﾞｲ'},
    'ŋ': {'æ':'ﾅ', 'a':'ﾅ', 'ɐ':'ﾅ', 'ə':'ﾅ', 'ʌ':'ﾅ', 'e':'ﾈ', 'ɛ':'ﾈ', 'i':'ﾆ', 'ɪ':'ﾆ', 'iː':'ﾆｰ', 'o':'ﾉ', 'ɔ':'ﾉ', 'u':'ﾇ', 'ʊ':'ﾇ', 'uː':'ﾇｰ', 'ɚ':'ﾅｰ', 'ɝ':'ﾅｰ', 'ɜː':'ﾅｰ', 'ɑː':'ﾅｰ', 'aɪ':'ﾅｲ', 'aʊ':'ﾅｳ', 'eɪ':'ﾈｲ', 'oʊ':'ﾉｳ', 'ɔɪ':'ﾉｲ'}, # 'n'の音で代用
    'kʲ':{'æ':'ｷｬ', 'a':'ｷｬ', 'ɐ':'ｷｬ', 'ə':'ｷｮ', 'ʌ':'ｷｬ', 'e':'ｷｪ', 'ɛ':'ｷｪ', 'i':'ｷ', 'ɪ':'ｷ', 'iː':'ｷｰ', 'o':'ｷｮ', 'ɔ':'ｷｮ', 'u':'ｷｭ', 'ʊ':'ｷｭ', 'uː':'ｷｭｰ', 'ɚ':'ｷｬｰ', 'ɝ':'ｷｬｰ', 'ɜː':'ｷｬｰ', 'ɑː':'ｷｬｰ', 'aɪ':'ｷｬｲ', 'aʊ':'ｷｬｳ', 'eɪ':'ｷｪｲ', 'oʊ':'ｷｮｳ', 'ɔɪ':'ｷｮｲ'}, # 拗音
    '?': {'æ':'ｱ', 'a':'ｱ', 'ɐ':'ｱ', 'ə':'ｱ', 'ʌ':'ｱ', 'e':'ｴ', 'ɛ':'ｴ', 'i':'ｲ', 'ɪ':'ｲ', 'iː':'ｲｰ', 'o':'ｵ', 'ɔ':'ｵ', 'u':'ｳ', 'ʊ':'ｳ', 'uː':'ｳｰ', 'ɚ':'ｱｰ', 'ɝ':'ｱｰ', 'ɜː':'ｱｰ', 'ɑː':'ｱｰ', 'aɪ':'ｱｲ', 'aʊ':'ｱｳ', 'eɪ':'ｴｲ', 'oʊ':'ｵｳ', 'ɔɪ':'ｵｲ'}, # 後続の母音のみを発音
}

DIPHTHONGS = {
    'aɪ': 'ｱｲ', 'aʊ': 'ｱｳ', 'eɪ': 'ｴｲ', 'oʊ': 'ｵｳ', 'ɔɪ': 'ｵｲ'
}

PHRASEBOOK ={
    "lɛts":"ﾚｯﾂ","ɪts":"ｲｯﾂ","ɪt":"ｲｯﾄ","hjuːmən":"ﾋｭｰﾏﾝ","ɡʊd":"ｸﾞｯﾄﾞ"
}